
# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# c = int(input("Введите третье число: "))
# d = int(input("Введите четвертое число: "))
# print(a-b/c-d)


# Пользователь вводит с клавиатуры пятизначное число.
# Требуется найти произведение цифр введеного числа и его среднее арефметическое

# n = int(input("Введите пятизначное число: "))
# a = n % 10
# n = n // 10
# b = n % 10
# n = n // 10
# c = n % 10
# n = n // 10
# e = n % 10
# n = n // 10
# f = n % 10
# z = n/5
# print(a * b * c * e * f)
# print("Среднее арефметическое: ", z)
