# n = 13
# i = 0
# while True:
#     a = int(input("Введите угадываемое число от 0 до 100: "))
#     if a == 0:
#         print("Вы прекратили пытаться! ")
#         print("Количество попыток ", i)
#         break
#     elif a > n:
#         print("Угадываемое число меньше")
#     elif a < n:
#         print("Угадываемое число больше")
#     elif a == n:
#         print('Вы угадали!')
#         print("Количество попыток ", i)
#         break
#     else:
#         print("Вы ввели не корректное число!")
#     i += 1